import streamlit as st

st.title("🏆 요일별 웹툰 랭킹")

ranking_data = {
    "월요일": [
        "신체",
        "참교육",
        "환생천마",
        "시한부 천재가 살아남는 ",
        "절대검"
    ],
    "화요일": [
        "44교시 생존수업",
        "절대회귀",
        "괴력 난신",
        "오! 나의 교주님",
        "회귀한 용병은 다 계획이 있다"
    ],
    "수요일": [
        "화산귀환",
        "별을 품은 소드마스터",
        "종말이 찾아왔다",
        "싸이코패스 in 무림",
        "조의 영역: 여의도"
    ],
    "목요일": [
        "나노마신",
        "나의 경험",
        "마흔 즈음에",
        "육아일기",
        "재벌집 막내아들"
    ],
    "금요일": [
        "광마회귀",
        "오! 나의 교주님",
        "외모지상주의",
        "나 혼자 만렙 뉴비",
        "상남자"
    ],
    "토요일": [
        "절대군림",
        "호랑이형님",
        "마도전생기",
        "시든 꽃에 눈물을",
        "만취남녀"
    ],
    "일요일": [
        "육아일",
        "범죄도시0",
        "럭키비치",
        "권왕환생",
        "태존비록"
    ]
}

day = st.selectbox(
    "📅 요일을 선택하세요",
    list(ranking_data.keys())
)

st.subheader(f"✨ {day} 인기 웹툰 TOP 5 ✨")

medals = ["🥇", "🥈", "🥉"]

for i, title in enumerate(ranking_data[day], start=1):
    if i <= 3:
        st.success(f"{medals[i-1]} {i}위 - {title}")
    else:
        st.write(f"🏅 {i}위 - {title}")

st.info("📌 네이버 웹툰 2026/09/30 기준")
