import streamlit as st

st.title("🏆 요일별 웹툰 랭킹")

ranking_data = {
    "월요일": [
        "전지적 독자 시점",
        "화산귀환",
        "작전명 순정",
        "참교육",
        "유미의 세포들"
    ],
    "화요일": [
        "외모지상주의",
        "약한영웅",
        "여신강림",
        "캐슬",
        "가비지타임"
    ],
    "수요일": [
        "나 혼자만 레벨업",
        "연애혁명",
        "격기 3반",
        "스위트홈",
        "정년이"
    ],
    "목요일": [
        "초인의 게임",
        "바른연애 길잡이",
        "타인은 지옥이다",
        "중증외상센터 : 골든 아워",
        "체크메이트"
    ],
    "금요일": [
        "철수를 구하시오",
        "세기말 풋사과 보습학원",
        "방탈출",
        "물가의 밤",
        "이번 생도 잘 부탁해"
    ],
    "토요일": [
        "남고 소년",
        "시맨틱 에러",
        "위험한 편의점",
        "돼지우리",
        "가비지타임"
    ],
    "일요일": [
        "살인자ㅇ난감",
        "작전명 순정",
        "화산귀환",
        "유미의 세포들",
        "캐슬"
    ]
}

day = st.selectbox(
    "📅 요일을 선택하세요",
    list(ranking_data.keys())
)

st.subheader(f"✨ {day} 인기 웹툰 TOP 5 ✨")

medals = ["🥇", "🥈", "🥉"]

for i, title in enumerate(ranking_data[day], start=1):
    if i <= 3:
        st.success(f"{medals[i-1]} {i}위 - {title}")
    else:
        st.write(f"🏅 {i}위 - {title}")

st.info("📌 얼른 보세요!!!")
